# Triangulate Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Face..::..Triangulate Method
Face Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Triangulate()()()() | Returns a triangular mesh approximation to the face. |
| Triangulate(Double) | Returns a triangular mesh approximation to the face. |

# See Also
Face Class
Face Members
Autodesk.Revit.DB Namespace